src/Enums/СпособВеденияБаланса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособВеденияБаланса</Name>
			<Comment>Способ ведения баланса</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоКомпании</Name>
					<Comment>По компании в целом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрганизации</Name>
					<Comment>В пределах организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПодразделению</Name>
					<Comment>В пределах подразделения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
					<Comment>ОСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
					<Comment>УСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрофессиональныйДоход</Name>
					<Comment>НПД</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
					<Comment>Автоматизированная УСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСХН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ГруппыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Только для персональных групп доступа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяГруппаДоступаПоставляемогоПрофиля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтроватьДокументыПоПользователю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыВнешнихПользователей</v8:Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсеРазрешены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Comment>Представлен пустой ссылкой основного типа значений</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступПоИерархии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрофилиДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Профиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ПраваИНастройкиПользователяГлобальныйВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРАВА И НАСТРОЙКИ ПОЛЬЗОВАТЕЛЯ

// Устанавливает новое значение права в кэше
//
// Параметры:
//  Право         - ПВХ ПраваИНастройки или Строка - Ссылка или имя предопределенного элемента ПВХ ПраваИНастройки
//  Значение      - Произвольный                   - Новое значение права
//  ОбъектДанных  - ДокументОбъект, ДокументСсылка, СправочникОбъект, СправочникСсылка. - Объект, для которого 
//                  получается расширение прав доступа
//                - Строка       - Имя объекта, для которого получается расширение прав доступа.
//
Процедура ОбновитьПравоВКэше(Право, НовоеЗначение, ОбъектДанных = Неопределено) Экспорт
	
	// Приводим значение параметра Право к типу ПланВидовХарактеристикСсылка.ПраваИНастройки.
	СтруктураПрава = ПраваИНастройкиПользователяПовтИсп.ПолучитьПараметрыПВХПравИНастроек(Право, "ПраваИНастройки");
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	// Получим структуру - кэш прав
	ЗначенияПрав = ПраваИНастройкиПользователяПовтИсп.ПолучитьЗначенияВсехПравПользователя();
	
	Если ЗначенияПрав <> Неопределено Тогда
		
		Если ОбъектДанных <> Неопределено И ОбъектДанных <> "" Тогда
			
			// Получим имя объекта данных
			Если ТипЗнч(ОбъектДанных) = Тип("Строка") Тогда
				ОбъектДанныхИмя = СокрЛП(ОбъектДанных);
			Иначе
				Попытка
					ОбъектДанныхИмя = ОбъектДанных.Ссылка.Метаданные().Имя;
				Исключение
					ОбъектДанныхИмя = "";
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		ПравоНаименование = СтруктураПрава.ИмяПредопределенныхДанных + ?(ЗначениеЗаполнено(ОбъектДанныхИмя), "_" + ОбъектДанныхИмя, "");
		
		// Временная проверка корректности наименования
		Если ПравоНаименование <> "" И СтрНайти(ПравоНаименование, " ") = 0 Тогда
			
			// Устанавливаем новое значение права
			ЗначенияПрав.Вставить(ПравоНаименование, НовоеЗначение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ОбновитьПравоВКэше()

// Получает значение права по имени или значению
//
// Параметры:
//  Право  - Строка             - Строка с именем или ссылка на ПВХ ПраваИНастройки искомого права
//  Объект - ПроизвольныйОбъект - Объект, для которого получаем расширение прав доступа
//         - Строка             - Имя объекта, для которого получается расширение прав доступа.
//
// Возвращаемое значение:
//  Значение - Значение запрошенного права.
//
Функция ПравоПользователя(Право, Объект=Неопределено) Экспорт
	
	// Получим кеш прав текущего пользователя
	ПраваПользователя = ПраваИНастройкиПользователяПовтИсп.ПолучитьЗначенияВсехПравПользователя();
	
	// Определим имя предопределенного элемента ПВХ
	Если ТипЗнч(Право)=Тип("ПланВидовХарактеристикСсылка.ПраваИНастройки") Тогда
		ИмяПраво = Право.ИмяПредопределенныхДанных;
	Иначе
		ИмяПраво = Право;
	КонецЕсли;
	
	// Определим имя объекта расширения данных
	Если Объект=Неопределено Тогда
		РасширениеДанных = "";
		
	ИначеЕсли ТипЗнч(Объект)=Тип("Строка") Тогда
		РасширениеДанных = СокрЛП(Объект);
		
	Иначе
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка));
		
		Если ОбъектМетаданных=Неопределено Тогда
			РасширениеДанных = "";
		Иначе
			РасширениеДанных = ОбъектМетаданных.Имя;
		КонецЕсли;
		
	КонецЕсли;
	
	// Если идентифицирован объект, то проверим наличие приватной установки для данного права.
	Если НЕ ПустаяСтрока(РасширениеДанных) И ПраваПользователя.Свойство(ИмяПраво + "_" + РасширениеДанных) Тогда
		Возврат ПраваПользователя[ИмяПраво + "_" + РасширениеДанных];
	КонецЕсли;
	
	// При первом запуске права могут быть не заполнены по умолчанию
	Если ПраваПользователя[ИмяПраво] = Неопределено Тогда
		ПраваПользователя[ИмяПраво] = Ложь;
	КонецЕсли;
	
	// Возвращаем значение права, закэшированного под этим именем
	Возврат ПраваПользователя[ИмяПраво];
	
КонецФункции // ПравоПользователя()

// Проверяет доступность у пользователя роли по имени
//
// Параметры:
//  Роль           - Строка    - Название роли как она задана в конфигураторе или объект описания метаданного роли. 
//
// Возвращаемое значение:
//  Булево - Доступность указанной роли для текущего пользователя.
//
Функция РольПользователя(Роль) Экспорт
	
	Результат = ПраваИНастройкиПользователяПовтИсп.ПроверитьРольПользователя(Роль);
	
	Возврат Результат;
	
КонецФункции // РольПользователя()


////////////////////////////////////////////////////////////////////////////////
// УЧЕТНЫЕ ПОЛИТИКИ

// Получает значение учетной политики по имени или значению
//
// Параметры:
//  УчетнаяПолитика  - Строка                                 - Строка с именем искомой учетной политики.
//                   - ПланВидовХарактеристик.УчетныеПолитики - Ссылка на элемент ПВХ УчетныеПолитики.
//  Объект           - СправочникСсылка.Организации           - Объект, для которого получается значение
//                   - СправочникСсылка.СкладыКомпании        - учетной политики.
//                   - СправочникСсылка.ПодразделенияКомпании - 
//  ДатаСреза        - Дата                                   - Дата, на которую получается значение учетной политики.
//  ИспользоватьЗначениеПоУмолчанию - Булево - Использовать значение по умолчанию, если учетная политика не настроена.
//                                    Истина: возвращать значение по умолчанию, Ложь: возвращать Неопределено.
//
// Возвращаемое значение:
//  Значение - Значение запрошенной учетной политики.
//
Функция ПолучитьЗначениеУчетнойПолитики(УчетнаяПолитика, Объект = Неопределено, Знач ДатаСреза = Неопределено, ИспользоватьЗначениеПоУмолчанию = Истина) Экспорт	
	Результат = Неопределено;
	
	Если ДатаСреза = Неопределено Тогда
		ДатаСреза = НачалоДня(ТекущаяДатаСеанса());
	Иначе
		ДатаСреза = НачалоДня(ДатаСреза);
	КонецЕсли;
	
	// Приводим значение параметра Право к типу ПланВидовХарактеристикСсылка.ПраваИНастройки.
	СтруктураУчетнойПолитики = ПраваИНастройкиПользователяПовтИсп.ПолучитьПараметрыПВХПравИНастроек(УчетнаяПолитика, "УчетныеПолитики");
	
	// Такого права нет в системе - явная ошибка. Нужен специалист
	Если НЕ ЗначениеЗаполнено(СтруктураУчетнойПолитики.Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
		
	// Получим структуру - кэш прав
	ЗначенияУчетныхПолитик = ПраваИНастройкиПользователяПовтИсп.ПолучитьВсеУчетныеПолитики(Объект, ДатаСреза, ИспользоватьЗначениеПоУмолчанию);
	
	ЗначенияУчетныхПолитик.Свойство(СтруктураУчетнойПолитики.ИмяПредопределенныхДанных, Результат);
	
	Возврат Результат;
	
КонецФункции // ПолучитьЗначениеУчетнойПолитики()

// Устанавливает новое значение права в кэше
//
// Параметры:
//  Право         - ПВХ ПраваИНастройки или Строка - Ссылка или имя предопределенного элемента ПВХ ПраваИНастройки
//  Значение      - Произвольный                   - Новое значение права
//  ОбъектДанных  - ДокументОбъект, ДокументСсылка, СправочникОбъект, СправочникСсылка. - Объект, для которого 
//                  получается расширение прав доступа
//                - Строка       - Имя объекта, для которого получается расширение прав доступа.
//
Процедура ОбновитьУчетнуюПолитикуВКэше(Параметр, НовоеЗначение, ОбъектДанных, Дата) Экспорт
	Если Дата = Неопределено Тогда
		Дата = НачалоДня(ТекущаяДатаСеанса());
	Иначе
		Дата = НачалоДня(Дата);
	КонецЕсли;
	
	// Приводим значение параметра Параметр к типу ПланВидовХарактеристикСсылка.УчетныеПолитики.
	СтруктураПрава = ПраваИНастройкиПользователяПовтИсп.ПолучитьПараметрыПВХПравИНастроек(Параметр, "УчетныеПолитики");
	УчетнаяПолитикаСсылка = СтруктураПрава.ИмяПредопределенныхДанных;
	
	// получим текущие значения учетных политик
	ЗначенияУчетныхПолитик = ПраваИНастройкиПользователяПовтИсп.ПолучитьВсеУчетныеПолитики(ОбъектДанных, Дата, Истина);
	
	Если ЗначенияУчетныхПолитик <> Неопределено Тогда	
		Если УчетнаяПолитикаСсылка <> Неопределено И УчетнаяПолитикаСсылка <> "" Тогда
			ЗначенияУчетныхПолитик.Вставить(УчетнаяПолитикаСсылка,НовоеЗначение);
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры // ОбновитьПравоВКэше()

// Получает значение учетной политики "Стратегии списания по датам"
//
// Параметры:
//  Склад       - СправочникСсылка.СкладыКомпании - Склад, для которого получается значение учетной политики;
//  Организация - СправочникСсылка.Организации    - Организация, для которой получается значение учетной политики;
//  ДатаСреза   - Дата                            - Дата, на которую получается значение учетной политики.
//
// Возвращаемое значение:
//  Значение - Значение запрошенной учетной политики.
//
Функция ПолучитьСтратегиюСписанияПоДатам(Склад, Организация, ДатаСреза = Неопределено) Экспорт
	
	ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("СтратегияСписанияПартийТоваровПоДатам", Склад, ДатаСреза, Ложь);
	
	Если НЕ ЗначениеЗаполнено(ЗначениеУчетнойПолитики) Тогда
		ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("СтратегияСписанияПартийТоваровПоДатам",
																	Организация, ДатаСреза, Ложь);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗначениеУчетнойПолитики) Тогда
		ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("СтратегияСписанияПартийТоваровПоДатам",
																	Неопределено, ДатаСреза);
	КонецЕсли;
	
	Возврат ЗначениеУчетнойПолитики;
	
КонецФункции //ПолучитьСтратегиюСписанияПоДатам()

// Получает значение учетной политики "Закрытие заказов по подразделению"
//
// Параметры:
//  Подразделение  - СправочникСсылка.ПодразделениеКомпании - Подразделение, для которого получается
//                                                            значение учетной политики;
//  ДатаСреза - Дата                            - Дата, на которую получается значение учетной политики.
//
// Возвращаемое значение:
//  Значение - Значение запрошенной учетной политики.
//
Функция ПолучитьЗакрытиеЗаказовПоПодразделению(Подразделение, ДатаСреза = Неопределено) Экспорт
	// Пробуем получить значение для подразделения, если нет - для организации,
	// если нет - для компании, если нет - по умолчанию.
	ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("ЗакрытиеЗаказовПоПодразделению", Подразделение, ДатаСреза, Ложь);
	
	Если НЕ ЗначениеЗаполнено(ЗначениеУчетнойПолитики) Тогда
		ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("ЗакрытиеЗаказовПоПодразделению",Подразделение.Организация, ДатаСреза, Ложь);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЗначениеУчетнойПолитики) Тогда
		ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("ЗакрытиеЗаказовПоПодразделению",Неопределено, ДатаСреза);
	КонецЕсли;
	
	Возврат ЗначениеУчетнойПолитики;
	
КонецФункции //ПолучитьЗакрытиеЗаказовПоПодразделению()

// Проверяет вхождение пользователя в группу доступа. Если Группа не задана, возвращает группу, в которую он входит.
//
// Параметры:
//  <Пользователь>   - <СправочникСсылка.Пользователи>  - Проверяемый пользователь
//  <ГруппаДоступа>  - <СправочникСсылка.ГруппыДоступа> - Проверяемая группа доступа, 
//                      <Неопределено> - В этом случае сюда будет возвращена группа доступа пользователя.
//
// Возвращаемое значение:
//  <Булево>  - Истина: пользователь входит в группу доступа, Ложь: не входит или это был вызов для определения группы.
//
Функция ГруппаДоступаПользователя(Знач Пользователь, Знач ПоискПерсональнойГруппы=Неопределено, Знач ИсключаяГруппуДоступа=Неопределено, ПерсональныйДоступ=Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Пользователь",          Пользователь);
	Запрос.УстановитьПараметр("ИсключаяГруппуДоступа", ИсключаяГруппуДоступа);
	
	Если ПоискПерсональнойГруппы=ИСТИНА Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ГруппыДоступа.Ссылка КАК ГруппаДоступа,
		|	ГруппыДоступа.Пользователь КАК Пользователь,
		|	ГруппыДоступа.ПометкаУдаления КАК Порядок
		|ИЗ
		|	Справочник.ГруппыДоступа КАК ГруппыДоступа
		|ГДЕ
		|	ГруппыДоступа.Пользователь = &Пользователь
		|	И ГруппыДоступа.Ссылка <> &ИсключаяГруппуДоступа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ГруппыДоступа.Ссылка КАК ГруппаДоступа,
		|	ГруппыДоступаПользователи.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|		ПО ГруппыДоступаПользователи.Ссылка = ГруппыДоступа.Ссылка
		|			И (НЕ ГруппыДоступа.ПометкаУдаления)
		|			И (ГруппыДоступа.Ссылка <> &ИсключаяГруппуДоступа)
		|ГДЕ ГруппыДоступаПользователи.Пользователь = &Пользователь";
		// Прежде всего интересует косвенное вхождение в группу, потом персональный доступ,
		// в конце - обычный участник группы.
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ПоискПерсональнойГруппы=ЛОЖЬ И НЕ ЗначениеЗаполнено(Выборка.Пользователь) Тогда
			ПерсональныйДоступ  = Неопределено;
			Возврат Неопределено;
		Иначе
			ПерсональныйДоступ  = ЗначениеЗаполнено(Выборка.Пользователь);
			Возврат Выборка.ГруппаДоступа;
		КонецЕсли;
	Иначе
		ПерсональныйДоступ  = Неопределено;
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ГруппаДоступаПользователя()

// Проверяет вхождение пользователя в группу доступа. Если Группа не задана, возвращает группу, в которую он входит.
//
// Параметры:
//  <Пользователь>   - <СправочникСсылка.Пользователи>  - Проверяемый пользователь
//  <ГруппаДоступа>  - <СправочникСсылка.ГруппыДоступа> - Проверяемая группа доступа, 
//                      <Неопределено> - В этом случае сюда будет возвращена группа доступа пользователя.
//
// Возвращаемое значение:
//  <Булево>  - Истина: пользователь входит в группу доступа, Ложь: не входит или это был вызов для определения группы.
//
Функция ПользовательВходитВГруппуДоступа(Пользователь, ГруппаДоступа = Неопределено, ИспользованиеПерсональногоДоступа=Неопределено) Экспорт
	
	// !!! Заменить везде вызов на ПолучитьГруппуДоступаПользователя
	НайденнаяГруппаДоступа = ГруппаДоступаПользователя(Пользователь, ИспользованиеПерсональногоДоступа,, ИспользованиеПерсональногоДоступа);
	
	Результат = (ГруппаДоступа=НайденнаяГруппаДоступа);
	ГруппаДоступа = НайденнаяГруппаДоступа;
	
	Возврат Результат;
	
КонецФункции // ПользовательВходитВГруппуДоступа()

// Получает значение учетной политики "способ ведения баланса" на переданную дату
// и проверяет является ли значение "По организации".
//
// Параметры:
//  <Дата>   - Дата, на которую получается значение учетной политики.
Функция БалансВедетсяПоОрганизациям(Дата) Экспорт
	СпособВеденияБаланса          = ПолучитьЗначениеУчетнойПолитики("СпособВеденияБаланса", Неопределено, Дата);
	БалансВедетсяПоОрганизациям   = (СпособВеденияБаланса=Перечисления.СпособВеденияБаланса.ПоОрганизации);
	
	Возврат БалансВедетсяПоОрганизациям;
КонецФункции

// Получает значение учетной политики "способ ведения баланса" на переданную дату
// и проверяет является ли значение "По организации".
//
// Параметры:
//  <Дата>   - Дата, на которую получается значение учетной политики.
Функция БалансВедетсяПоПодразделениям(Дата) Экспорт
	СпособВеденияБаланса          = ПолучитьЗначениеУчетнойПолитики("СпособВеденияБаланса", Неопределено, Дата);
	БалансВедетсяПоПодразделениям  = (СпособВеденияБаланса=Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	Возврат БалансВедетсяПоПодразделениям;
КонецФункции

// Получает признак того, что подразделение/организация освобожден от НДС
//
// Параметры:
//  Организация - СправочникСсылка.Организации    - Организация, для которой получается значение учетной политики;
//  Подразделение  - СправочникСсылка.ПодразделениеКомпании - Подразделение, для которого получается
//                                                            значение учетной политики;
//  ДатаСреза   - Дата                            - Дата, на которую получается значение учетной политики.
//
// Возвращаемое значение:
//  Значение - Значение запрошенной учетной политики.
//
Функция ОсвобожденОтУплатыНДС(Организация, ПодразделениеКомпании, ДатаСреза = Неопределено) Экспорт
	
	ОсвобожденОтНДС = Ложь;
	
	Если ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
		ВидНалога = ПолучитьЗначениеУчетнойПолитики("ВидНалога", ПодразделениеКомпании, ДатаСреза);
		ОсвобожденОтНДС = (НЕ ВидНалога = Перечисления.ВидыНалогов.ПустаяСсылка());
	КонецЕсли;
	
	Если НЕ ОсвобожденОтНДС И ЗначениеЗаполнено(Организация) Тогда
		СистемаНалогообложения = ПолучитьЗначениеУчетнойПолитики("СистемаНалогообложения", Организация, ДатаСреза);
		ОсвобожденОтНДС = (СистемаНалогообложения = Перечисления.СистемыНалогообложения.Упрощенная);
	КонецЕсли;
	
	Возврат ОсвобожденОтНДС;
	
КонецФункции // ОсвобожденОтУплатыНДС()
